driver-tests/bpelse/xsddatatypes/XSDDataTypesBpel/src/XSDVariable_SDT_Operations/additions1.wsdl

<definitions targetNamespace="http://stc.com/additions1" 
    name="additions1" 
    xmlns:tns="http://stc.com/additions1" 
    xmlns:ns1="urn:MostDataType"    
    xmlns:slnk1="http://docs.oasis-open.org/wsbpel/2.0/plnktype" 
    xmlns:tns0="http://stc.com/additions1" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns="http://schemas.xmlsoap.org/wsdl/" 
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
    xmlns:slnk="http://schemas.xmlsoap.org/ws/2002/07/service-link/">
    
    <import location="MostDataType.xsd" namespace="urn:MostDataType"/>      
    <message name="additions1">
        <part name="part" element="ns1:item"/>
    </message>
    <portType name="additions1">
        <operation name="additions1">
            <input message="tns:additions1"/>
            <output message="tns:additions1"/>
        </operation>
    </portType>
    <binding name="Binding" type="tns:additions1">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="additions1">
            <soap:operation soapAction="additions1"/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="additions1Service">
        <port name="port" binding="tns:Binding">
            <soap:address location="http://localhost:${HttpDefaultPort}/additions1"/>
        </port>
    </service>
    <plnk:partnerLinkType name="SLT" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
        <plnk:role name="server" portType="tns:additions1"/>
    </plnk:partnerLinkType>
</definitions>
