driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/XSDVariable_SDT_Operations1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="urn:MostDataType">
      <ns1:any_int xmlns:ns1="urn:MostDataType">
        <ns1:xsd_int>77</ns1:xsd_int>
      </ns1:any_int>
      <ns1:any_integer xmlns:ns1="urn:MostDataType">
        <ns1:xsd_integer>777</ns1:xsd_integer>
      </ns1:any_integer>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>