driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/results/XSDVariable_SDT_Operations1/Actual_20130311131751_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <item xmlns="urn:MostDataType" xmlns:msgns="http://stc.com/additions1">
      <any_int>
        <xsd_int>77</xsd_int>
      </any_int>
      <any_integer>
        <xsd_integer>777</xsd_integer>
      </any_integer>
    </item>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>