driver-tests/bpelse/xsddatatypes/XSDDataTypesJbi/test/XSDVariable_SDT_Operations1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:MostDataType">
  <soapenv:Body>
    <urn:item>
      <urn:any_int>
        <urn:repeat_int>44</urn:repeat_int>
        <urn:repeat_int>33</urn:repeat_int>
      </urn:any_int>
      <urn:any_integer>
        <urn:repeat_integer>444</urn:repeat_integer>
        <urn:repeat_integer>333</urn:repeat_integer>
      </urn:any_integer>
    </urn:item>
  </soapenv:Body>
</soapenv:Envelope>